modules/controllers/PostsController.php

SELECT * FROM `posts`
---
    public function actionLst(){
        $model=new Posts();
        $data=$model->find()->asArray()->all();

SELECT * FROM `posts` WHERE `id`='2'
SELECT * FROM `category`
---
    public function actionEdit(){
        $model=new Posts();
        if(YII::$app->request->isPost){
            $model = Posts::findOne($_GET['id']);
            $model->cat_name=YII::$app->request->post('cat_name');
            $model->title=YII::$app->request->post('Posts')['title'];
            $model->content=YII::$app->request->post('Posts')['content'];
            $model->status=YII::$app->request->post('Posts')['status'];
            $model->image=$_FILES['Posts']['name']['image'];
            if ($model->save()) {
                echo "修改成功";
                die;
            }else{
                echo "失败";
                die;
            }

        }
        $tree=new Category();
        $data=$tree->find()->asArray()->all();