modules/views/posts/edit.php

SELECT * FROM `posts` WHERE id=2
---
?>
<?php $model = new Posts();?>
<?php
    $res=$model->find()->asArray()->where("id=".$_GET['id'])->one();